# http://aa.matome-web.com/
#

import random

def SelectAA(N):
	if N<0:
		return AAlist[random.randrange(len(AAlist))]
	elif N<len(AAlist):
		return AAlist[N]
	else:
		return f"I have only {len(AAlist)-1} AAs"


AA00="""
∧＿∧    끝났어요
( ´･ω･) 차라도 드시지요
( つ旦O 　
と＿)＿)　旦愛旦旦旦旦毒旦旦旦
"""

AA01="""
   측정 끝!!!
☆｡+ ∧＿∧
　　　( ´∀`)
　 ／￣||―、＼_ ｡｡｡
☆｜[三∪● )三mΕ∃
*　＼＿へ―ｲ＼　 ﾟﾟﾟ
+♪ﾟ*　(＿)(＿)　☆｡
☆｡+　☆°+
　 ｡*☆ﾟx*+ﾟ｡☆ο+｡*
"""

AA02="""
   작업 끝났다의 선언
　 _＿
　 / )))　　　 ＿
`／ イ~　　　(((ヽ
(　 ﾉ　　　　 ￣Ｙ＼
|　(＼　∧＿∧　｜　)
ヽ　ヽ`(　`o´　)／ノ/
　＼ |　⌒Ｙ⌒　/ /
　 ｜ヽ　 ｜　 ﾉ／
　　＼トー仝ーイ
　　 ｜ ミ土彡/
"""

AA03="""
이제 겨우 끝났나?

　　　∧_∧::
　　 (´･ω･`)::
　 /⌒　　⌒)::
　/ へ_＿/ /::
(＿＼＼ﾐ)/::
　｜ `-イ::
　 /ｙ　 )::
/／　／::
／　／::
"""

AA04="""
    끝났네 끝났어
　　　　　∩ ∧__∧
　　　　　ヽ( ^ω^ )^)
　　　　 _／＼　　＿/
　　　　(_／＼　／
　　　　　　　) ) ♪
　　　　　　 (＿)
　＿＿_／(＿＿＿
／　　(＿＿＿_／
￣￣￣￣￣￣￣
"""

AA05="""
    끝나면 깨워줘

　　 ⊂⌒／ヽ-、＿_
　／⊂_/＿＿＿＿ ／
　￣￣￣￣￣￣￣

   벌써 끝났어? 
   
　　　　∩∩
　　　（´･ω･）
　　 ＿|　⊃／(＿＿_
　／　└-(＿＿＿_／
　￣￣￣￣￣￣￣

"""

AA06="""
    ハ_ハ
    (ﾟωﾟ )
    　νヽν｜
    　 <　<
    
    　ハ_ハ
    ヘ(ﾟωﾟ )　슉
    　　ヽヘ｜
    　 　<　<
    
＿人人人人人人人人人人人＿
＞ 측정이 끝났다의 포즈！＜
￣Y^Y^Y^ Y^Y^Y^Y^Y^Y￣
"""

AA07="""
╰(　・´ｰ・｀)╯╰(　・´ｰ・｀)╯╰(　・´ｰ・｀)╯

╰(　・´ｰ・｀)╯╰(　・´ｰ・｀)╯╰(　・´ｰ・｀)╯

╰(　・´ｰ・｀)╯╰(　・´ｰ・｀)╯╰(　・´ｰ・｀)╯

╰(　・´ｰ・｀)╯╰(　・´ｰ・｀)╯╰(　・´ｰ・｀)╯
"""

AA08="""
측정이 끝났다네
이거라도 마시게

　　　　∧_∧
　　　 (`･ω･) 휙
　 　　(つ と彡 /
　　　　　／　 /
　　　　／　　/
　　　／ //　/
　　／ 旦　 / 끼긱~
　／　　　 /

"""

AA09="""
┳┻| 
┻┳| 
┳┻|_∧ 
┻┳|ω･) 끝났으려나...
┳┻|⊂ﾉ 
┻┳| Ｊ
"""

AA10="""
우ㅇ와ㅏㅏㅏㅏㅏㅏㅏㅏㅏ 다됐따ㅏㅏㅏ
　ﾉ”′∧∧∧∧、ヽ､
((と(ﾟДﾟ三ﾟДﾟ)つ))
　＼ヽﾐ　三　彡 ソ
　　 )ﾐ ､_　彡ノ
　　(ﾐ∪三∪彡
　　 ＼ヾ丿ノ
　　　 ヽ ﾉ
　　　　)ﾉ
　　　 ((
"""

AA11="""
결과 보자ー！
　 　∧_∧
　　(`･ω･´ ) 三
　　O┳〇 )
　　◎し◎- 三
"""

AA12="""
다 끝났어요~
　　　∧＿∧ 
　　　(´･ω･) 
　　　(　つ┳⊃ 
　　　ε(_)へ⌒ヽﾌ 
　　 (　　(〃･з･) 
≡≡　◎―◎ ⊃ ⊃
"""

AA13="""
A____A
| ・ㅅ・ | 
|っ　 ｃ| 
|　끝　| 
|　났　| 
|　습　| 
|　니　|
|　다　|
U￣￣U
"""

AA14="""
o　　　ﾟ　o　　　　ﾟ　　ﾟ　　o
　○ ＜”￣＼ 。　o .　ﾟ　　　｡
。 ﾟ.o |＿＿__） 。.ﾟ　　다 됐다!
　。ヽ(´・ω・`)/　。ﾟ　　　　o
。　 （::. 　　 ）。　ﾟ.　　o
"""

AA15="""
일하기 싫다
　　∧_∧
　（ ´・ω・)
　//＼￣￣旦 ＼
／/ ※ ＼＿＿＿＿＼
＼＼ 　※ 　※ 　※ ヽ
　 ＼ヽ-＿_＿–＿__ヽ
"""

AA16="""
　　　　　／/
　　　　／　/
　　　 / 　 /　 덜컹
　　　 / ∩ﾊ,,ﾊ
　　 /　|( ﾟωﾟ)＿　 많이 기다렸지?
　　/／ |　　　ヽ／
　　”￣￣￣”∪
"""

AA17="""
●ヽ( ･ω･`)ﾉ●
　●ヽ(･ω･`)ﾉ●
　　●(ω･`ﾉ●
　　　(･`● )
　　 (●　　)ﾉ●
　 ●ヽ(　　 )ﾉ●
　　●(　 ´)ﾉ●
　　　(　´ﾉ●
　　　( ﾉ● )
　　　●´･ω)
　 ●ヽ( ･ω･)●
　●ヽ( ･ω･`)ﾉ●
"""

AA18="""
꿀꿀꿀
　　 ε⌒ﾍ⌒ヽﾌ
　　 (　( ･ω･)　　꿀꿀
　 ε⌒ﾍ⌒ヽﾌ⌒ヽﾌ
　 (　( ･ω･) ･ω･)　　꿀꿀꿀꿀
ε⌒ﾍ⌒ヽﾌ⌒ヽﾌ⌒ヽﾌ
(　( ･ω･) ･ω･) ･ω･)
‘し-し-Ｊ し-Ｊし-Ｊ
"""

AA19="""
∧,,∧ 
( ‘ω’ )つ 결과 나옴 
（m9 ＼ 　 봐도 좋다！
　 ＼　 ＼ 
　 　 ) ) ＼ 
　 ／／ ＼ ＼ 
　 (＿） 　 (＿)
"""

AA20="""
일단 결과나 봐 볼까
. 　　　 ∧,,_∧
　　 ⊂ ( ･ω･ )つ-
　 ／／/　　 /::/
　 |::|/⊂ヽノ|::|」
／￣￣旦￣￣￣／|
＿＿＿＿＿＿／　| |
|——ー—-ー|／
"""


AAlist=[]
	
for i in range(21):
	AAlist.append(eval(f'AA{str(i).zfill(2)}'))